# Preppin Data 2022 Week 2

In [1]:
import pandas as pd
import numpy as np
import datetime as dt

In [54]:
data=pd.read_csv('C:/Users/yash/Downloads/PD 2022 Wk 1 Input - Input.csv')

In [55]:
data.head()

,id,pupil first name,pupil last name,gender,Date of Birth,Parental Contact Name_1,Parental Contact Name_2,Preferred Contact Employer,Parental Contact
0,1,Ronna,Nellies,Female,12/21/2013,Purcell,Ketti,Demizz,1
1,2,Rusty,Andriulis,Male,7/21/2012,Vassili,Rivi,Brainbox,1
2,3,Roberta,Oakeshott,Female,12/4/2011,Lind,Haskell,Centidel,2
3,4,Lola,Rubinfajn,Male,6/29/2012,Elie,Tresa,Edgeblab,2
4,5,Kamila,Benedtti,Female,7/10/2012,Adela,Clevey,Trudoo,1

In [56]:
#Removing columns that are not required
data=data.drop(['id','gender','Parental Contact Name_1','Parental Contact Name_2','Parental Contact','Preferred Contact Employer'],axis=1)

In [57]:
data['Pupil Name']=data['pupil first name']+" "+data['pupil last name']

In [58]:
data=data.drop(['pupil first name','pupil last name'],axis=1)

In [59]:
data.head(2)

  Date of Birth       Pupil Name
0    12/21/2013    Ronna Nellies
1     7/21/2012  Rusty Andriulis

In [60]:
data['Date of Birth']=pd.to_datetime(data['Date of Birth'])

In [61]:
data.dtypes

Date of Birth    datetime64[ns]
Pupil Name               object
dtype: object

In [62]:
data['month']=data['Date of Birth'].dt.month

In [63]:
data['day']=data['Date of Birth'].dt.day

In [64]:
data.head()

  Date of Birth         Pupil Name  month  day
0    2013-12-21      Ronna Nellies     12   21
1    2012-07-21    Rusty Andriulis      7   21
2    2011-12-04  Roberta Oakeshott     12    4
3    2012-06-29     Lola Rubinfajn      6   29
4    2012-07-10    Kamila Benedtti      7   10

In [65]:
data["This Year's Birthday"]="2022"+"-"+data['month'].map(str)+"-"+data['day'].map(str)

In [66]:
data.dtypes

Date of Birth           datetime64[ns]
Pupil Name                      object
month                            int64
day                              int64
This Year's Birthday            object
dtype: object

In [67]:
data['This Year\'s Birthday']=pd.to_datetime(data['This Year\'s Birthday'])

In [68]:
data=data.drop(['month','day'],axis=1)

In [69]:
data.head()

  Date of Birth         Pupil Name This Year's Birthday
0    2013-12-21      Ronna Nellies           2022-12-21
1    2012-07-21    Rusty Andriulis           2022-07-21
2    2011-12-04  Roberta Oakeshott           2022-12-04
3    2012-06-29     Lola Rubinfajn           2022-06-29
4    2012-07-10    Kamila Benedtti           2022-07-10

In [72]:
data['Month']=data['This Year\'s Birthday'].dt.month_name()

In [80]:
data['Cake Needed On']=data['This Year\'s Birthday'].dt.day_name()

In [81]:
data.head(2)

  Date of Birth       Pupil Name This Year's Birthday     Month Cake Needed On
0    2013-12-21    Ronna Nellies           2022-12-21  December      Wednesday
1    2012-07-21  Rusty Andriulis           2022-07-21      July       Thursday

In [92]:
data["Cake Needed On"]=np.where((data['Cake Needed On']=="Saturday"),"Friday",data["Cake Needed On"])

In [93]:
data["Cake Needed On"]=np.where((data['Cake Needed On']=="Sunday"),"Friday",data["Cake Needed On"])

In [94]:
data2=data.groupby(["Month", "Cake Needed On"]).size().reset_index(name="BDs per weekday and month")

In [103]:
data2.head()

   Month Cake Needed On  BDs per weekday and month
0  April         Friday                         55
1  April         Monday                         10
2  April       Thursday                         11
3  April        Tuesday                          4
4  April      Wednesday                         12

In [99]:
final=data.merge(data2, on=['Month','Cake Needed On'], how='left')

In [106]:
column_names=["Pupil Name","Date of Birth","This Year's Birthday","Month","Cake Needed On","BDs per weekday and month"]

In [107]:
final=final.reindex(columns=column_names)

In [108]:
final.tail(10)

,Pupil Name,Date of Birth,This Year's Birthday,Month,Cake Needed On,BDs per weekday and month
990,Gwen Glowinski,2012-03-04,2022-03-04,March,Friday,31
991,Henrie Wrightson,2014-12-01,2022-12-01,December,Thursday,20
992,Ludwig Raine,2014-02-18,2022-02-18,February,Friday,31
993,Hamel Pie,2013-12-24,2022-12-24,December,Friday,45
994,Tamma Sergison,2012-06-19,2022-06-19,June,Friday,30
995,Ninetta Worling,2015-02-15,2022-02-15,February,Tuesday,13
996,Stanford Tinton,2013-04-09,2022-04-09,April,Friday,55
997,Ertha MacCook,2013-12-14,2022-12-14,December,Wednesday,9
998,Lawton Randles,2011-12-12,2022-12-12,December,Monday,20
999,Engracia Pashbee,2013-09-23,2022-09-23,September,Friday,36